作為一ㄍ有博士學位ㄉ好孩紙，怎可用跟愚夫愚婦一樣ㄉ方式學codingㄋ？？？
聰明如我，馬上就想到，作為一ㄍ讀書人，沒事就喜歡找資料看資料分析資料，那第一ㄍ下手ㄉ語言最好是可以速度弄出小爬蟲、做視覺化處理的語言

擔心鴨鴨真的要去7-11打工ㄉ家教團聽了後，一致認同爬說嘴（python）會是最好ㄉ入手語言
於是，鴨鴨我就選定ㄌ自動處理呆丸covid-19報表作為課題（幹疾管署的資料呈現真的難看到爆）
開始ㄌ鴨生展新的篇章

只是ㄋ，要重新作鴨，畢竟不是那摩容易
去youtube看了幾個怎麼用python做crawlerㄉ教學影片後覺得這麼簡單我也可以
灌ㄍbeautifulsoup4有蛇謀難ㄉ

一開始還喜滋滋ㄉ想說，ㄏㄏ，我自己上網查到要在terminal打pip(Package Installer for Python)這個指令
窩怎模那麼不廢，窩真的4文科博士ㄇ

結果，事情不是窩想ㄉ那摩簡單
怎麼call都call不到beautifulsoup4 ㄉfunction！？到底花生省魔術！？
弄了一整個晚上，才發現

哎呀～～～～～pip跟pip3是不一樣ㄉㄋ！

用pip會灌去mac內建的python 2，而不是另外安裝的python3啊啊啊啊啊啊啊


一ㄍ晚上就J魔過去ㄌ
我們還是咖扎睏咖舞眠

<END of Day One>
